export const initQuestions = () => {
	return [
		{
			id: 1,
			question: "我喜欢把一件事情做完后再做另一件事。"
		},
		{
			id: 2,
			question: "在工作中我喜欢独自筹划，不愿受别人干涉。"
		},
		{
			id: 3,
			question: "在集体讨论中，我往往保持沉"
		},
		{
			id: 4,
			question: "我喜欢做戏剧、音乐、歌舞、新闻采访等方面的工作。"
		},
		{
			id: 5,
			question: "每次写信我都一挥而就，不再重复。"
		},
		{
			id: 6,
			question: "我经常不停地思考某一问题,直到想出正确的答案。"
		},
		{
			id: 7,
			question: "对别人借我的和我借别人的东西,我都能记得很清楚。"
		},
		{
			id: 8,
			question: "我喜欢抽象思维的工作,不喜欢动手的工作。"
		},
		{
			id: 9,
			question: "我喜欢成为人们注意的焦点。"
		},
		{
			id: 10,
			question: "我喜欢不时地夸耀一下自己取得的好成就"
		},
		{
			id: 11,
			question: "我曾经渴望有机会参加探险。"
		},
		{
			id: 12,
			question: "当我一个独处时，会感到更愉快。"
		},
		{
			id: 13,
			question: "我喜欢在做事情前，对此事情做出细致的安排。"
		},
		{
			id: 14,
			question: "我讨厌修理自行车、电器一类的工作。"
		},
		{
			id: 15,
			question: "我喜欢参加各种各样的聚会。"
		},
		{
			id: 16,
			question: "我愿意从事虽然工资少、但是比较稳定的职业。"
		},
		{
			id: 17,
			question: "音乐能使我陶醉。"
		},
		{
			id: 18,
			question: "我办事很少思前想后。"
		},
		{
			id: 19,
			question: "我喜欢经常请示上级。"
		},
		{
			id: 20,
			question: "我喜欢需要运用智力的游戏。"
		},
		{
			id: 21,
			question: "我很难做那种需要持续集中注意力的工作。"
		},
		{
			id: 22,
			question: "我喜欢亲自动手制作一些东西，从中得到乐趣。"
		},
		{
			id: 23,
			question: "我的动手能力很差。"
		},
		{
			id: 24,
			question: "和不熟悉的人交谈对我来说毫不困难。"
		},
		{
			id: 25,
			question: "和别人谈判时，我总是很容易放弃自己的观点。"
		},
		{
			id: 26,
			question: "我很容易结识同性朋友。"
		},
		{
			id: 27,
			question: "对于社会问题,我通常持中庸的态度。"
		},
		{
			id: 28,
			question: "当我开始做一件事情后，即使碰到再多的困难,我也要执著地干下去。"
		},
		{
			id: 29,
			question: "我是一个沉静而不易动感情的人。"
		},
		{
			id: 30,
			question: "当我工作时，我喜欢避免干扰。"
		},
		{
			id: 31,
			question: "我的理想是当一名科学家。"
		},
		{
			id: 32,
			question: "与言情小说相比,我更喜欢推理小说。"
		},
		{
			id: 33,
			question: "有些人太霸道,有时明明知道他们是对的，也要和他们对着干。"
		},
		{
			id: 34,
			question: "我爱幻想。"
		},
		{
			id: 35,
			question: "我总是主动地向别人提出自己的建议。"
		},
		{
			id: 36,
			question: "我喜欢使用榔头一类的工具。"
		},
		{
			id: 37,
			question: "我乐于解除别人的痛苦。"
		},
		{
			id: 38,
			question: "我更喜欢自己下了赌注的比赛或游戏。"
		},
		{
			id: 39,
			question: "我喜欢按部就班地完成要做的工作。"
		},
		{
			id: 40,
			question: "我希望能经常换不同的工作来做。"
		},
		{
			id: 41,
			question: "我总留有充裕的时间去赴约会。"
		},
		{
			id: 42,
			question: "我喜欢阅读自然科学方面的书籍和杂志。"
		},
		{
			id: 43,
			question: "如果掌握一门手艺并能以此为生，我会感到非常满意。"
		},
		{
			id: 44,
			question: "我曾渴望当一名汽车司机。"
		},
		{
			id: 45,
			question: "听别人谈‘家中被盗’一类的事，很难引起我的同情。"
		},
		{
			id: 46,
			question: "如果待遇相同，我宁愿当商品推销员，而不愿当图书管理员。"
		},
		{
			id: 47,
			question: "我讨厌跟各类机械打交道。"
		},
		{
			id: 48,
			question: "我小时候经常把玩具拆开，把里面看个究竟。"
		},
		{
			id: 49,
			question: "当接受新任务后，我喜欢以自己的独特方法去完成它。"
		},
		{
			id: 50,
			question: "我有文艺方面的天赋。"
		},
		{
			id: 51,
			question: "我喜欢把一切安排得整整齐齐、井井有条。"
		},
		{
			id: 52,
			question: "我喜欢作一名教师。"
		},
		{
			id: 53,
			question: "和一群人在一起的时候，我总想不出恰当的话来说。"
		},
		{
			id: 54,
			question: "看情感影片时，我常禁不住眼圈红润。"
		},
		{
			id: 55,
			question: "我讨厌学数学。"
		},
		{
			id: 56,
			question: "在实验室里独自做实验会令我寂寞难耐。"
		},
		{
			id: 57,
			question: "对于急躁、爱发脾气的人，我仍能以礼相待。"
		},
		{
			id: 58,
			question: "遇到难解答的问题时，我常常放弃。"
		},
		{
			id: 59,
			question: "大家公认我是一名勤劳踏实的、愿为大家服务的人。"
		},
		{
			id: 60,
			question: "我喜欢在人事部门工作。"
		}
	]
}