export const initQuestions = () => {
	return [
		{
			id: 1,
			question: "我喜欢把一件事情做完后再做另一件事。"
		},
		{
			id: 2,
			question: "在工作中我喜欢独自筹划，不愿受别人干涉。"
		},
		{
			id: 3,
			question: "在集体讨论中，我往往保持沉"
		},
		{
			id: 4,
			question: "我喜欢做戏剧、音乐、歌舞、新闻采访等方面的工作。"
		},
		{
			id: 5,
			question: "每次写信我都一挥而就，不再重复。"
		},
		{
			id: 6,
			question: "我经常不停地思考某一问题,直到想出正确的答案。"
		},
		{
			id: 7,
			question: "对别人借我的和我借别人的东西,我都能记得很清楚。"
		},
		{
			id: 8,
			question: "我喜欢抽象思维的工作,不喜欢动手的工作。"
		},
		{
			id: 9,
			question: "我喜欢成为人们注意的焦点。"
		},
		{
			id: 10,
			question: "我喜欢不时地夸耀一下自己取得的好成就"
		},
		{
			id: 11,
			question: "我曾经渴望有机会参加探险。"
		},
		{
			id: 12,
			question: "当我一个独处时，会感到更愉快。"
		},
		{
			id: 13,
			question: "我喜欢在做事情前，对此事情做出细致的安排。"
		},
		{
			id: 14,
			question: "我讨厌修理自行车、电器一类的工作。"
		},
		{
			id: 15,
			question: "我喜欢参加各种各样的聚会。"
		},
		{
			id: 16,
			question: "我愿意从事虽然工资少、但是比较稳定的职业。"
		},
		{
			id: 17,
			question: "音乐能使我陶醉。"
		},
		{
			id: 18,
			question: "我办事很少思前想后。"
		},
		{
			id: 19,
			question: "我喜欢经常请示上级。"
		},
		{
			id: 20,
			question: "我喜欢需要运用智力的游戏。"
		},
		{
			id: 21,
			question: "我很难做那种需要持续集中注意力的工作。"
		},
		{
			id: 22,
			question: "我喜欢亲自动手制作一些东西，从中得到乐趣。"
		},
		{
			id: 23,
			question: "我的动手能力很差。"
		},
		{
			id: 24,
			question: "和不熟悉的人交谈对我来说毫不困难。"
		},
		{
			id: 25,
			question: "和别人谈判时，我总是很容易放弃自己的观点。"
		},
		{
			id: 26,
			question: "我很容易结识同性朋友。"
		},
		{
			id: 27,
			question: "对于社会问题,我通常持中庸的态度。"
		},
		{
			id: 28,
			question: "当我开始做一件事情后，即使碰到再多的困难,我也要执著地干下去。"
		},
		{
			id: 29,
			question: "我是一个沉静而不易动感情的人。"
		},
		{
			id: 30,
			question: "当我工作时，我喜欢避免干扰。"
		},
		{
			id: 31,
			question: "我的理想是当一名科学家。"
		},
		{
			id: 32,
			question: "与言情小说相比,我更喜欢推理小说。"
		},
		{
			id: 33,
			question: "有些人太霸道,有时明明知道他们是对的，也要和他们对着干。"
		},
		{
			id: 34,
			question: "我爱幻想。"
		},
		{
			id: 35,
			question: "我总是主动地向别人提出自己的建议。"
		},
		{
			id: 36,
			question: "我喜欢使用榔头一类的工具。"
		},
		{
			id: 37,
			question: "我乐于解除别人的痛苦。"
		},
		{
			id: 38,
			question: "我更喜欢自己下了赌注的比赛或游戏。"
		},
		{
			id: 39,
			question: "我喜欢按部就班地完成要做的工作。"
		},
		{
			id: 40,
			question: "我希望能经常换不同的工作来做。"
		},
		{
			id: 41,
			question: "我总留有充裕的时间去赴约会。"
		},
		{
			id: 42,
			question: "我喜欢阅读自然科学方面的书籍和杂志。"
		},
		{
			id: 43,
			question: "如果掌握一门手艺并能以此为生，我会感到非常满意。"
		},
		{
			id: 44,
			question: "我曾渴望当一名汽车司机。"
		},
		{
			id: 45,
			question: "听别人谈‘家中被盗’一类的事，很难引起我的同情。"
		},
		{
			id: 46,
			question: "如果待遇相同，我宁愿当商品推销员，而不愿当图书管理员。"
		},
		{
			id: 47,
			question: "我讨厌跟各类机械打交道。"
		},
		{
			id: 48,
			question: "我小时候经常把玩具拆开，把里面看个究竟。"
		},
		{
			id: 49,
			question: "当接受新任务后，我喜欢以自己的独特方法去完成它。"
		},
		{
			id: 50,
			question: "我有文艺方面的天赋。"
		},
		{
			id: 51,
			question: "我喜欢把一切安排得整整齐齐、井井有条。"
		},
		{
			id: 52,
			question: "我喜欢作一名教师。"
		},
		{
			id: 53,
			question: "和一群人在一起的时候，我总想不出恰当的话来说。"
		},
		{
			id: 54,
			question: "看情感影片时，我常禁不住眼圈红润。"
		},
		{
			id: 55,
			question: "我讨厌学数学。"
		},
		{
			id: 56,
			question: "在实验室里独自做实验会令我寂寞难耐。"
		},
		{
			id: 57,
			question: "对于急躁、爱发脾气的人，我仍能以礼相待。"
		},
		{
			id: 58,
			question: "遇到难解答的问题时，我常常放弃。"
		},
		{
			id: 59,
			question: "大家公认我是一名勤劳踏实的、愿为大家服务的人。"
		},
		{
			id: 60,
			question: "我喜欢在人事部门工作。"
		}
	]
}

export const initResult = () => {
	return {
		type_Normal: {
			name: '传统型人格',
			jobs: ['精通针灸的宫廷皇医', '龙族的财务管理员', '研究秘药配方的炼金术师', '龙族企业的秘书', '精通精灵语的教师', '忠诚的兽人伐木工'],
			desc: '保守、服从、友善且正直，传统型人格的人，在工作中的表现很平淡，更喜欢有序和系统的工作，无意谋求高位。他们热爱生活，真诚待人，讲求实际，注重自身的责任感，能够合情合理地做事情，并且会尽自己最大能力完成。',
		},
		type_Reality: {
			name: '现实型人格',
			jobs: ['秘术学院的精灵研究师', '四处游学的妖精画家', '哥布林城堡工程师', '强化兵器的巨人锻造师', '鸽子驿站的鸟人管理员', '日行千里的人马信使'],
			desc: '现实型人格，偏好从事讲究规则和原则的工作，缺少一定的社会交往技能，不适应人际交往要求高的岗位。做事情踏实、努力，愿意为了喜欢的工作付出，也值得领导信任。思维速度快，具有很高的动手能力。爱好机械器具，喜欢钻研其中的运作原理。',
		},
		type_Research: {
			name: '研究型人格',
			jobs: ['研究多元宇宙的数学家', '从事机械制造的侏儒工程师', '测试火药的矮人工程师', '陷阱设计专业的忍者', '从事公益事业的哥布林', '培育史莱姆的公务员'],
			desc: '喜欢独处，不喜欢喧闹，要是有人打扰自己思考，他们会表现得十分恼火。希望能够了解事情的全部，爱刨根问底。说话和做事都比较直接，不会拐弯抹角，关注个人的私密，能够保守秘密。生活中比较被动，更喜欢当一个倾听者，遇到问题能提出解决办法，格局架构较高，比较有内涵。',
		},
		type_Management: {
			name: '企业型人格',
			jobs: ['自动种菜机器推销员', '网红酒楼的矮人小老板', '龙族盔甲营销主管', '公正的天使仲裁官', '“龙娘至上”教派的创始人', '卖烤串创业的巨人'],
			desc: '积极主动，拥有良好的智商和情商，在一个团队中通常都是主力军，能够真正地扛事儿。精力充沛，才艺出众，擅长人际交往，对于人与人之间的关系把握得很彻底。他们的职业生涯，大部分都是通过竞争实现。优秀、自信且圆滑，各方面都非常出众。',
		},
		type_Social: {
			name: '社会型人格',
			jobs: ['精灵村里最好的医生', '出访蜥蜴人国的猫娘大使', '救助受灾哥布林难民的厨师', '百战百胜的矮人律师', '史莱姆学院的政治老师', '推销墨镜的夜行者销售员'],
			desc: '喜欢与人交往，对所从事的职业充满激情，能够利用自身所学到的知识不断帮助别人，是一个富有正义感的人。思维活跃，具有创新意识，能够做到信守承诺，人缘非常不错。擅长与人打交道，不喜欢固定、单一的技术性工作。',
		},
		type_Art: {
			name: '艺术型人格',
			jobs: ['时尚布甲的设计师', '穿搭期刊《美丽秘书师》的编辑', '巨人族摇滚乐音乐家', '妖精村的舞蹈家', '史莱姆巧克力的包装设计师', '城墙设计院加班的矮人设计师'],
			desc: '生性浪漫，追求理想，不愿意屈服于现实。叛逆、激情且充满干劲儿，愿意为了心中的艺术而不断付出。感知能力强，善于体察别人情绪的异样，也能够对此做出相应的改变。文艺鉴赏性强，也拥有不错的审美能力，在艺术上有极高的造诣。有灵气，举止得体，身上流露出不俗的气质。',
		},
	}
}